# parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
#depth_multiple: 1.0 # model depth multiple
#width_multiple: 1.0 # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DWConv, [32, 3, 1]],       # 0 608x608
   [-1, 1, DWConv, [64, 3, 2]],       # 1 304x304
   [-1, 1, DWBottleneck, [64]],       # 2
   [-1, 1, DWConv, [128, 3, 2]],      # 3 152x152
   [-1, 2, DWBottleneckCSP, [128]],   # 4
   [-1, 1, DWConv, [256, 3, 2]],      # 5 76x76
   [-1, 8, DWBottleneckCSP, [256]],   # 6
   [-1, 1, DWConv, [512, 3, 2]],      # 7 38x38
   [-1, 8, DWBottleneckCSP, [512]],   # 8
   [-1, 1, dConv, [1024, 3, 1]],    # 9 38x38
   [-1, 4, dBottleneckCSP, [1024]], # 10
  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512]],                     # 11
   [-1, 1, DWConv, [256, 1, 1]],                 # 12
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']], # 13
   [8, 1, DWConv, [256, 1, 1]],                  # 14
   [[-1, -2], 1, Concat, [1]],                 # 15
   [-1, 2, DWBottleneckCSP2, [256]],             # 16
   [-1, 1, DWConv, [128, 1, 1]],                 # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 18
   [6, 1, DWConv, [128, 1, 1]],                  # 19
   [[-1, -2], 1, Concat, [1]],                 # 20
   [-1, 2, DWBottleneckCSP2, [128]],             # 21
   #[-1, 1, Conv, [256, 3, 1]],                 # 22
   [-1, 1, nn.Conv2d, [24, 1, 1]],
   [-2, 1, DWConv, [256, 3, 2]],                 # 23
   [[-1, 15], 1, Concat, [1]],                 # 24
   [-1, 2, DWBottleneckCSP2, [256]],             # 25
   #[-1, 1, Conv, [512, 3, 1]],                 # 26
   [-1, 1, nn.Conv2d, [24, 1, 1]],
   [-2, 1, DWConv, [512, 3, 1]],                 # 27
   [[-1, 11], 1, Concat, [1]],                 # 28
   [-1, 2, DWBottleneckCSP2, [512]],             # 29
   #[-1, 1, Conv, [1024, 3, 1]],                # 30
   [-1, 1, nn.Conv2d, [24, 1, 1]],
   [[21,25,29], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
