# parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [12,16, 19,36, 40,28]  # P3/8
  - [36,75, 76,55, 72,146]  # P4/16
  - [142,110, 192,243, 459,401]  # P5/32

# yolov4s backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],       # 0
   [-1, 1, Conv, [64, 3, 2]],       # 1 304x304
   [-1, 1, Bottleneck, [64]],       # 2
   [-1, 1, Conv, [128, 3, 2]],      # 3 152x152
   [-1, 2, BottleneckCSP, [128]],   # 4
   [-1, 1, Conv, [256, 3, 2]],      # 5 76x76
   [-1, 8, BottleneckCSP, [256]],   # 6
   [-1, 1, Conv, [512, 3, 2]],      # 7 38x38
   [-1, 8, BottleneckCSP, [512]],   # 8
   [-1, 1, Conv, [1024, 3, 2]],     # 9 19x19
   [-1, 4, BottleneckCSP, [1024]],  # 10
  ]

# yolov4s head
# na = len(anchors[0])
head:
  [[-1, 1, SPPCSP, [512]],                     # 11
   [-1, 2, BottleneckCSP2, [256]],             # 12
   [-1, 1, Conv, [512, 1, 1]],                 # 13 512,19x19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 14
   [[-1, 8], 1, Concat, [1]],                  # 15
   [-1, 2, BottleneckCSP2, [512]],             # 16
   [-1, 1, Conv, [256, 3, 1]],                 # 17 256,38x38
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 18
   [[-1, 6], 1, Concat, [1]],                  # 19
   [-1, 2, BottleneckCSP2, [512]],             # 20
   [-1, 1, Conv, [256, 3, 1]],                 # 21 256,76x76

   [[21,17,13], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
