# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # expand model depth
width_multiple: 1.0  # expand layer channels
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# darknet53 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DWConv, [32, 3, 1]],    # 0 608x608
   [-1, 1, DWConv, [64, 3, 2]],    # 1 304x304
   [-1, 1, DWBottleneck, [64]],    # 2
   [-1, 1, DWConv, [128, 3, 2]],   # 3 152x152
   [-1, 2, DWBottleneckCSP, [128]],   # 4
   [-1, 1, DWConv, [256, 3, 2]],   # 5 76x76
   [-1, 8, DWBottleneckCSP, [256]],   # 6
   [-1, 1, DWConv, [512, 3, 2]],   # 7 38x38
   [-1, 8, DWBottleneckCSP, [512]],   # 8
   [-1, 1, DWConv, [1024, 3, 2]],  # 9 19x19
   [-1, 4, DWBottleneckCSP, [1024]],  # 10
  ]

# yolov3-spp head
# na = len(anchors[0])
head:
  [[-1, 1, DWBottleneck, [1024, False]],         # 11
   [-1, 1, SPP, [512, [5, 9, 13]]],            # 12
   [-1, 1, DWConv, [1024, 3, 1]],                # 13
   [-1, 1, DWConv, [512, 1, 1]],                 # 14
   [-1, 1, DWConv, [1024, 3, 1]],                # 15
   [-1, 1, nn.Conv2d, [512, 1, 1]],            # 16 512,19x19

   [-3, 1, DWConv, [256, 1, 1]],                 # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 18
   [[-1, 8], 1, Concat, [1]],                  # 19
   [-1, 1, DWBottleneck, [512, False]],          # 20
   [-1, 1, DWBottleneck, [512, False]],          # 21
   [-1, 1, DWConv, [256, 1, 1]],                 # 22
   [-1, 1, DWConv, [512, 3, 1]],                 # 23
   [-1, 1, nn.Conv2d, [256, 1, 1]],            # 24 256,38x38

   [-3, 1, DWConv, [128, 1, 1]],                 # 25
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 26
   [[-1, 6], 1, Concat, [1]],                  # 27
   [-1, 1, DWBottleneck, [256, False]],          # 28
   [-1, 2, DWBottleneck, [256, False]],          # 29
   [-1, 1, nn.Conv2d, [256, 1, 1]],            # 30 256,76x76

   [[16,24,30], 1, ASFF, [24,0]],              # 31 1024，19X19
   [[16,24,30], 1, ASFF, [24,1]],              # 32 512，38X38
   [[16,24,30], 1, ASFF, [24,2]],              # 33 256，76X76

   [[31,32,33], 1, Detect, [nc, anchors]],     # Detect(P3, P4, P5)
  ]
